Autodesk.Revit.DB.BuiltInFailures.SkylightFailures.MinSkylightWidthMetric
The minimum skylight width is 203.2 millimeters.

Autodesk.Revit.DB.BuiltInFailures.SkylightFailures.MinSkylightWidthImperial
The minimum skylight width is 8 inches.

Autodesk.Revit.DB.BuiltInFailures.SkylightFailures
Failures about Skylight.